Repository: omatheusolegario/econance-app
Catalog: lib/l10n/app_*.arb
Languages: pt

# screenwelcomepage
source: Welcome Back
pt: Bem-vindo de volta

# welcomeMessage
source: Welcome to
pt: Bem-vindo ao

source: Login
pt: Entrar

# createAccount
source: Create an account
pt: Criar uma conta

# carousel1
source: The ultimate and most comprehensive financial management app.
pt: O melhor e mais compreensivo aplicativo de gerenciamento de finanças.

# carousel2
source: Access powerful insights about your money and make smarter decisions every day.
pt: Acesse insights poderosos sobre seu dinheiro e tome decisões mais inteligentes todos os dias.

# carousel3
source: Take full control of your finances in the palm of your hand, wherever you are.
pt: Tenha o controle total das suas finanças na palma da mão, onde quer que você esteja.

# welcomeBack
source: Welcome back to Econance
pt: Bem-vindo de volta ao Econance

source: Phone Number
pt: Número de telefone

source: Email address
pt: Endereço de email

# emailinput
source: Enter your email
pt: Digite seu email

# phoneinput
source: Enter your phone number
pt: Digite seu número de telefone

# templateemail
source: example@gmail.com
pt: exemplo@gmail.com

source: Password
pt: Senha

source: Forgot password?
pt: Esqueceu sua senha?

# snackloginSuccess
source: Login was successful!
pt: O login foi realizado com sucesso!

# snackloginError
source: Login failed
pt: O login falhou

# emailverification
source: A verification email has been sent. Please check your email
pt: Um email de verificação foi enviado. Por favor cheque seu email.

# iverified
source: I have verified
pt: Eu já verifiquei

# resendverification
source: Resend verification email
pt: Reenviar email de verificação

# notverified
source: Email not verified yet!
pt: O email não foi verificado ainda!

# resendwarning
source: Verification email resent!
pt: Email de verificação reenviado!

source: Full name
pt: Nome completo

# exitAppTitle
source: Exit app?
pt: Sair do app?

# exitAppContent
source: Are you sure you want to exit Econance?
pt: Tem certeza que deseja sair do Econance?

source: Cancel
pt: Cancelar

source: Exit
pt: Sair

# separateExpensesInto
source: Separate your expenses into
pt: Separe suas despesas em

# categoriesTitle
source: Categories
pt: Categorias

source: Revenues
pt: Receitas

source: Expenses
pt: Despesas

source: Category updated
pt: Categoria atualizada

source: Category deleted
pt: Categoria excluída

# nameLabel
source: Name
pt: Nome

# exampleFoodHint
source: Ex: Food
pt: Ex: Alimentação

# typeLabel
source: Type
pt: Tipo

# selectCategoryType
source: Select a category type
pt: Selecione um tipo de categoria

source: Expense
pt: Despesa

source: Revenue
pt: Receita

source: Save
pt: Salvar

source: Delete
pt: Excluir

source: No data yet
pt: Sem dados ainda

# pleaseFillAllFields
source: Please fill all fields first
pt: Por favor preencha todos os campos primeiro

source: Remove
pt: Remover

source: Add New Item
pt: Adicionar novo item

source: Details
pt: Detalhes

# chooseCategoryDateRecurrence
source: Choose category, date and recurrence
pt: Escolha categoria, data e recorrência

source: Is this recurrent?
pt: Isto é recorrente?

source: Is recurrent?
pt: É recorrente?

source: New Category
pt: Nova categoria

source: New Expense
pt: Nova despesa

source: New Revenue
pt: Nova receita

source: New Investments
pt: Novo investimento

# newInvestmentTypes
source: New Investments Type
pt: Novo tipo de investimento

# removeLabel
source: Remove
pt: Remover

source: No user found with this email
pt: Nenhum usuário encontrado com este e-mail

source: Invite sent
pt: Convite enviado

# userAlreadyInFamily
source: User already in a family
pt: Usuário já faz parte de uma família

source: Invite
pt: Convidar

# inviteMemberTitle
source: Invite member
pt: Convidar membro

# memberEmailHint
source: member@example.com
pt: membro@exemplo.com

# participateInExistingFamilyWith
source: Participate in an existing family with
pt: Participe de uma família existente com

source: Invite new members to your family with
pt: Convide novos membros para sua família com

source: Invites
pt: Convites

source: Unknown
pt: Desconhecido

source: No pending invites
pt: Sem convites pendentes

source: Family name can't be empty
pt: O nome da família não pode estar vazio

# createFamilyTitle
source: Create Family
pt: Criar família

# familyNameHint
source: Family name
pt: Nome da família

source: Change role
pt: Alterar função

source: View member graphs
pt: Ver gráficos do membro

source: Remove from family
pt: Remover da família

# removeMemberTitle
source: Remove member?
pt: Remover membro?

# removeMemberContent
source: Are you sure you want to remove this member?
pt: Tem certeza que deseja remover este membro?

source: Admin
pt: Administrador

source: Member
pt: Membro

source: Waiting response from
pt: Aguardando resposta de

source: Declined invite
pt: Convite recusado

source: Accepted invite
pt: Convite aceito

source: Deleted Invite
pt: Convite deletado

# leaveFamilyTitle
source: Leave Family?
pt: Sair da família?

# leaveFamilyContent
source: Are you sure you want to leave this family?
pt: Tem certeza que deseja sair desta família?

source: No
pt: Não

source: Yes
pt: Sim

# deleteFamilyTitle
source: Delete Family?
pt: Deletar família?

# deleteFamilyContent
source: You are the last one in the family, leaving will delete it. Are you sure?
pt: Você é o último na família, sair irá deletá-la. Tem certeza?

source: Delete Family
pt: Deletar família

source: Leave Family
pt: Sair da família

# graphsManageIntro
source: Here you'll manage
pt: Aqui você gerenciará

source: Finances
pt: Finanças

# errorLoadingData
source: An error occurred while loading data.
pt: Ocorreu um erro ao carregar os dados.

# noInformationAvailable
source: No information available at the moment.
pt: Nenhuma informação disponível no momento.

source: Sensitive data hidden
pt: Dados sensíveis ocultos

# balanceHidden
source: The balance is R$•••••
pt: O saldo é R$•••••

# balanceIs
source: The balance is
pt: O saldo é

# checkRevenuesExpenses
source: Want to check on revenues/expenses?
pt: Quer checar suas receitas/despesas?

source: Check
pt: Verificar

source: No expenses recorded.
pt: Nenhuma despesa registrada.

# noRevenueRecorded
source: No revenues recorded.
pt: Nenhuma receita registrada.

source: Manage your categories
pt: Gerencie suas categorias

source: Manage
pt: Gerenciar

source: Manage your investments
pt: Gerencie seus investimentos

source: Manage your investment types
pt: Gerencie seus tipos de investimento

source: No investments found
pt: Nenhum investimento encontrado

source: Investments by Type
pt: Investimentos por tipo

# trackManageInvestments
source: Track and manage your investments
pt: Acompanhe e gerencie seus investimentos

source: Your Investments
pt: Seus investimentos

source: No investments yet
pt: Nenhum investimento ainda

source: Active
pt: Ativo

source: Closed
pt: Fechado

# searchInvestmentTypesHint
source: Search investment types...
pt: Pesquisar tipos de investimento...

# noTypesFoundAddOne
source: No types found. Add one first!
pt: Nenhum tipo encontrado. Adicione um primeiro!

source: Select
pt: Selecionar

source: Organize your investments by
pt: Organize seus investimentos por

source: Investment Types
pt: Tipos de investimento

source: No investment types yet
pt: Nenhum tipo de investimento ainda

source: Balance Over Time
pt: Saldo ao longo do tempo

source: Revenue Over Time
pt: Receita ao longo do tempo

source: Expenses Over Time
pt: Despesas ao longo do tempo

source: Investments Over Time
pt: Investimentos ao longo do tempo

source: No categories found
pt: Nenhuma categoria encontrada

source: Expenses by Category
pt: Despesas por categoria

source: Revenues by Category
pt: Receitas por categoria

# balanceLabel
source: Balance
pt: Saldo

# investmentsLabel
source: Investments
pt: Investimentos

# stepFullName
source: Full name
pt: Nome completo

# stepPhone
source: Phone
pt: Telefone

# stepPasswordVerification
source: Password & Verification
pt: Senha e Verificação

# enterFullNameError
source: Please enter your full name
pt: Por favor digite seu nome completo

# enterValidEmail
source: Please enter a valid email
pt: Por favor digite um email válido

# enterValidPhone
source: Please enter a valid phone number
pt: Por favor digite um telefone válido

# passwordMin6
source: Password must be at least 6 characters
pt: A senha deve ter no mínimo 6 caracteres

source: Verification email sent
pt: Email de verificação enviado

# registrationError
source: Error while registering
pt: Erro ao registrar

source: Weak password
pt: Senha muito fraca

source: Email already in use
pt: Email já em uso

source: Email not verified.
pt: Email não verificado.

# enterFullNameLabel
source: Enter your full name
pt: Digite seu nome completo

# enterEmailLabel
source: Enter your email
pt: Digite seu email

# enterPhoneLabel
source: Enter your phone
pt: Digite seu telefone

source: Register
pt: Registrar

source: Verify Email
pt: Verificar Email

# completeRegistration
source: Complete your registration
pt: Complete seu cadastro

source: Next
pt: Próximo

# passwordResetSent
source: Password reset link sent! Check your email
pt: Link de redefinição enviado! Verifique seu email

# errorOccurred
source: An error occurred
pt: Ocorreu um erro

# noUserFoundForEmail
source: No user found for that email
pt: Nenhum usuário encontrado para este email

# forgotPasswordAppBar
source: Forgot Password
pt: Esqueceu a senha

# forgotPasswordTitle
source: Forgot Password?
pt: Esqueceu sua senha?

# recoverAccessSubtitle
source: Recover access to your account
pt: Recupere o acesso à sua conta

# resetInstruction
source: Enter your email and we'll send you a link to reset your password
pt: Digite seu email e enviaremos um link para redefinir sua senha

source: Send reset link
pt: Enviar link de redefinição

source: Give your category a name
pt: Dê um nome à sua categoria

source: Choose the type
pt: Escolha o tipo

# isYourCategoryAnExpenseOrRevenue
source: Is your category an expense or a revenue?
pt: Sua categoria é uma despesa ou uma receita?

source: Category successfully added!
pt: Categoria adicionada com sucesso!

source: Add another category
pt: Adicionar outra categoria

source: Type updated
pt: Tipo atualizado

source: Type deleted
pt: Tipo excluído

# exampleStocksHint
source: e.g. Stocks
pt: Ex: Ações

source: Investment Info
pt: Informações do investimento

# enterInvestmentInfo
source: Enter the basic information of your investment.
pt: Insira as informações básicas do seu investimento.

# exampleBitcoinHint
source: e.g. Bitcoin
pt: Ex: Bitcoin

source: Select type
pt: Selecionar tipo

source: Financial Info
pt: Informações financeiras

# enterFinancialInfo
source: Enter investment value, target and rate.
pt: Insira valor, meta e taxa do investimento.

# investedValueLabel
source: Invested Value (R$)
pt: Valor investido (R$)

# targetValueLabel
source: Target Value (R$)
pt: Valor alvo (R$)

# rateLabel
source: Rate (%)
pt: Taxa (%)

source: Status & Notes
pt: Status e observações

# selectStatusDateAndNotes
source: Select status, date and add optional notes.
pt: Selecione status, data e adicione observações opcionais.

source: Select status
pt: Selecionar status

# dateLabel
source: Date
pt: Data

source: Select date
pt: Selecionar data

# notesLabel
source: Notes
pt: Observações

source: Optional observations
pt: Observações opcionais

source: Investment added successfully!
pt: Investimento adicionado com sucesso!

source: Add Another Investment
pt: Adicionar outro investimento

source: Required
pt: Obrigatório

# addItemTitle
source: Add Item
pt: Adicionar item

# editItemTitle
source: Edit Item
pt: Editar item

# itemNameLabel
source: Item name
pt: Nome do item

# exampleItemHint
source: e.g. Laptop charger
pt: Ex: Carregador de notebook

# pleaseEnterName
source: Please enter a name
pt: Por favor insira um nome

# valueLabel
source: Value
pt: Valor

# valueExampleHint
source: e.g. 120.50
pt: Ex: 120,50

# pleaseEnterValue
source: Please enter a value
pt: Por favor insira um valor

# enterValidNumber
source: Enter a valid number
pt: Digite um número válido

source: Add
pt: Adicionar

source: Transaction added successfully!
pt: Transação adicionada com sucesso!

source: Add another transaction
pt: Adicionar outra transação

# addTransactionTitle
source: Add {type}
pt: Adicionar {type}

# addTransactionSubtitle
source: First insert the value of the transaction, then a short commentary if you want to
pt: Primeiro insira o valor da transação, depois um comentário curto se quiser

source: Optional commentary
pt: Comentário opcional

source: Select Category
pt: Selecionar categoria

# itemsLabel
source: Items
pt: Itens

# cameraNotFound
source: No compatible camera found.
pt: Nenhuma câmera compatível encontrada.

# cameraPermissionRequired
source: Camera permission is required.
pt: Permissão da câmera é necessária.

# captureImageError
source: Error capturing image
pt: Erro ao capturar imagem

source: Could not extract sufficient data.
pt: Não foi possível extrair dados suficientes.

# newCategoryCreatedPrefix
source: New category created
pt: Nova categoria criada

# ocrExtractionError
source: Error extracting data
pt: Erro ao extrair dados

# scanInvoiceTitle
source: Scan the Invoice
pt: Escaneie a nota fiscal

# scanInvoiceSubtitle
source: and register your expense
pt: e registre sua despesa

# invoiceInstructions
source: Position the invoice and press the capture button. Use flash if necessary (top right).
pt: Posicione a nota fiscal e pressione o botão de captura. Use o flash se necessário (canto superior direito).

# scanYourNF
source: Scan your NF and
pt: Escaneie sua Nota Fiscal e

source: Categorize your purchases
pt: Categorize suas compras

source: Add Bill
pt: Adicionar conta

source: Type name cannot be empty
pt: O nome do tipo não pode ficar vazio

# addInvestmentTypeTitle
source: Add Investment Type
pt: Adicionar tipo de investimento

# addInvestmentTypeSubtitle
source: Give your type a name (e.g. Crypto, Stocks, Real Estate)
pt: Dê um nome ao seu tipo (ex: Cripto, Ações, Imóveis)

# exampleInvestmentTypeHint
source: e.g. Crypto
pt: Ex: Cripto

source: Type successfully added!
pt: Tipo adicionado com sucesso!

source: Add another type
pt: Adicionar outro tipo

# editInvestmentTitle
source: Edit Investment
pt: Editar investimento

source: General
pt: Geral

source: Financials
pt: Financeiro

# statusAndNotes
source: Status & Notes
pt: Status e Observações

source: Back
pt: Voltar

# familyManageIntro
source: Here you can manage
pt: Aqui você pode gerenciar

# familyMembersTitle
source: Family members
pt: Membros da família

# aiPhrase1
source: Analyzing family finances...
pt: Analisando finanças da família...

# aiPhrase2
source: Generating family report...
pt: Gerando relatório familiar...

# aiPhrase3
source: Comparing incomes and expenses...
pt: Comparando rendas e despesas...

# aiPhrase4
source: Evaluating everyone's investments...
pt: Avaliando investimentos de todos...

# aiPhrase5
source: Preparing personalized family insights...
pt: Preparando insights personalizados da família...

# aiPhrase6
source: Analyzing finances...
pt: Analisando finanças...

# aiPhrase7
source: Generating report...
pt: Gerando relatório...

# aiPhrase8
source: Comparing incomes and expenses...
pt: Comparando rendas e despesas...

# aiPhrase9
source: Evaluating investments...
pt: Avaliando investimentos...

# aiPhrase10
source: Preparing personalized insights...
pt: Preparando insights personalizados...

# awaitingAdminInsights
source: Please wait for the admin to generate insights.
pt: Aguarde o administrador gerar os insights.

source: No insights available
pt: Nenhuma insight disponível

# aiInsightsTitle
source: AI Insights
pt: Insights de IA

# familyAiInsightsTitle
source: Family AI Insights
pt: Insights de IA da família

# aiIntro
source: Here you'll get,
pt: Aqui você terá,

source: Family space
pt: Espaço familiar

# manageTransactionsIntro
source: Here, you will manage
pt: Aqui você gerenciará

# revenuesExpensesTitle
source: Revenues & Expenses
pt: Receitas e Despesas

# searchCategoriesHint
source: Search categories...
pt: Pesquisar categorias...

source: Confirm your email
pt: Confirme seu email

source: Close
pt: Fechar

# iHaveConfirmedLogin
source: I have confirmed
pt: Já confirmei

source: Camera
pt: Câmera

source: Gallery
pt: Galeria

source: Settings
pt: Configurações

source: Update
pt: Atualizar

source: vs last month
pt: vs mês passado

source: Create
pt: Criar

source: Confirm
pt: Confirmar

# aboutUsFullText
source: # About Econance Econance, created by a group of young students from the Systems Development technical course, was developed to simplify financial management for individuals and families. Based on research and the importance of financial education, the app aims to help users control their spending, track their income, and plan their goals in a simple, practical, and accessible way. With an intuitive interface and features designed for everyday use, Econance seeks to encourage responsible money habits and contribute to a more balanced and organized financial life. ## Acknowledgements We thank everyone who, in some way, contributed to the development of this project. Special thanks to our teacher Débora Paulo, TCC advisor, and to the technical course teachers Mário, Cristiano, Daniel, and Maria Ângela for all their guidance throughout these three years.
pt: # Sobre o Econance O Econance, criado por um grupo de jovens, do curso técnico de Desenvolvimento de Sistemas, foi desenvolvido para facilitar o gerenciamento financeiro de pessoas e famílias. Baseado em pesquisas e na importância da educação financeira, o aplicativo tem como objetivo ajudar o usuário a controlar seus gastos, acompanhar suas receitas e planejar suas metas de forma simples, prática e acessível. Com uma interface intuitiva e recursos pensados para o dia a dia, o Econance busca incentivar o uso consciente do dinheiro e contribuir para uma vida financeira mais equilibrada e organizada. ## Agradecimentos Agradecemos a todos que, de alguma forma, contribuíram para o desenvolvimento deste projeto. Em especial, à nossa professora Débora Paulo, orientadora de TCC, e aos professores do ensino técnico Mário, Cristiano, Daniel e Maria Ângela, por todos os ensinamentos ao longo desses três anos.

source: Language
pt: Idioma

source: English
pt: Inglês

source: Portuguese
pt: Português

# enterCurrentPassword
source: Please provide your current password.
pt: Por favor, informe sua senha atual.

# updateSuccess
source: {field} updated successfully!
pt: {field} atualizado com sucesso!

source: No user logged in.
pt: Nenhum usuário logado.

# emailUpdatedAndReauthenticated
source: Email updated and session re-established.
pt: Email atualizado e sessão restabelecida.

# reloginFailed
source: Could not log in automatically. Please sign in manually.
pt: Não foi possível logar automaticamente. Faça login manualmente.

# logoutTitle
source: Logout
pt: Sair

# logoutContent
source: Are you sure you want to sign out?
pt: Tem certeza que deseja sair?

# deactivateAccountTitle
source: Deactivate account
pt: Desativar conta

# deactivateAccountContent
source: Do you want to temporarily deactivate your account?
pt: Deseja desativar temporariamente sua conta?

# accountDeactivated
source: Account deactivated successfully.
pt: Conta desativada com sucesso.

# deleteAccountTitle
source: Delete account
pt: Excluir conta

# deleteAccountContent
source: This action is permanent. Do you want to continue?
pt: Essa ação é permanente. Deseja continuar?

# accountDeleted
source: Account deleted permanently.
pt: Conta excluída permanentemente.

# imageUpdatedSuccess
source: Image updated successfully!
pt: Imagem atualizada com sucesso!

# imageUpdateError
source: Error updating image
pt: Erro ao atualizar imagem

source: Theme
pt: Tema

source: Dark mode
pt: Modo escuro

source: Light mode
pt: Modo claro

source: Change Name
pt: Alterar nome

source: Change Email
pt: Alterar email

source: Change Phone
pt: Alterar telefone

source: Change Password
pt: Alterar senha

source: About us
pt: Sobre nós

# aboutUsSubtitle
source: Learn more about Econance
pt: Saiba mais sobre o Econance

source: Update {field}
pt: Atualizar {field}

source: Current password
pt: Senha atual

source: New {field}
pt: Novo {field}

# selectTypeFirst
source: Select a type first
pt: Selecione um tipo primeiro

# emailVerificationSentContent
source: An email verification was sent to {email}. Click the link to complete the update.
pt: Um e-mail de verificação foi enviado para {email}. Clique no link para completar a atualização.
